AccumulationRegisters/ОстаткиИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиИмущества</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Имущество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ИнвентаризацияСервер/Ext/Module.bsl
// Общий модуль: ИнвентаризацияСервер
// Обязательные настройки: [x] Сервер, [x] Вызов сервера

#Область ПрограммныйИнтерфейс

// Главная функция для проверки возможности проведения операции.
// Принимает структуру данных и возвращает результат проверки.
// Параметры:
//  ПараметрыОперации - Структура: Имущество, Количество, Кабинет, ПроверятьОстаток.
// Возвращает:
//  Структура: Успех (Булево), Сообщение (Строка).
Функция ПроверитьВозможностьДвижения(ПараметрыОперации) Экспорт
	
	Результат = Новый Структура("Успех, Сообщение", Истина, "");
	
	Попытка
		// 1. Валидация входных данных (базовые проверки)
		Если Не ЗначениеЗаполнено(ПараметрыОперации.Имущество) Тогда
			ВызватьИсключение "Не выбрано имущество в одной из строк.";
		КонецЕсли;
		
		Если ПараметрыОперации.Количество <= 0 Тогда
			ВызватьИсключение "Количество должно быть больше нуля (" + Строка(ПараметрыОперации.Имущество) + ").";
		КонецЕсли;
		
		// 2. Проверка остатков (актуально для Списания и Перемещения)
		Если ПараметрыОперации.Свойство("ПроверятьОстаток") И ПараметрыОперации.ПроверятьОстаток Тогда
			
			// Проверка заполнения кабинета перед вызовом запроса (важно для исключения ОшибкиХранимыхДанных)
			Если Не ЗначениеЗаполнено(ПараметрыОперации.Кабинет) Тогда
				ВызватьИсключение "Для проверки остатков должен быть указан кабинет.";
			КонецЕсли;
			
			Остаток = ТекущийОстатокИмущества(ПараметрыОперации.Имущество, ПараметрыОперации.Кабинет);
			
			Если Остаток < ПараметрыОперации.Количество Тогда
				ВызватьИсключение СтрШаблон("Недостаточно имущества '%1' в кабинете '%2'. В наличии: %3, требуется: %4", 
					Строка(ПараметрыОперации.Имущество), Строка(ПараметрыОперации.Кабинет), Остаток, ПараметрыОперации.Количество);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		// Захват и возврат текста ошибки
		Результат.Успех = Ложь;
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Получает актуальный остаток из регистра накопления.
// Параметры:
//  Имущество - СправочникСсылка.Имущество
//  Кабинет   - СправочникСсылка.Кабинеты
// Возвращает:
//  Число - Количество остатка.
Функция ТекущийОстатокИмущества(Имущество, Кабинет) Экспорт
	
	// Очистка параметров от возможных битых ссылок или неопределенных значений
	ПараметрИмущество = ?(Имущество = Неопределено, Справочники.Имущество.ПустаяСсылка(), Имущество);
	ПараметрКабинет   = ?(Кабинет   = Неопределено, Справочники.Кабинеты.ПустаяСсылка(), Кабинет);
	
	Запрос = Новый Запрос;
	// Используем ЕСТЬNULL и передаем пустую дату в параметры таблицы для стабильности
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиИмуществаОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиИмущества.Остатки(&Период, Имущество = &Имущество И Кабинет = &Кабинет) КАК ОстаткиИмуществаОстатки";
	
	Запрос.УстановитьПараметр("Имущество", ПараметрИмущество);
	Запрос.УстановитьПараметр("Кабинет",   ПараметрКабинет);
	Запрос.УстановитьПараметр("Период",    ТекущаяДата()); // Указываем дату, чтобы запрос не падал на расчете текущих итогов
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Остаток;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
